tap "charmbracelet/tap"
tap "homebrew/services"
tap "mac-cleanup/mac-cleanup-py"
tap "mdp/tap"
tap "mongodb/brew"
tap "teamookla/speedtest"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bash"
brew "openssl@3"
brew "bat"
brew "boost"
brew "readline"
brew "sqlite"
brew "bpytop"
brew "freetype"
brew "ccache"
brew "cmake"
brew "docker"
brew "docker-compose"
brew "dua-cli"
brew "python@3.13"
brew "freeglut"
brew "fzf"
brew "gmp"
brew "git"
brew "glfw"
brew "glm"
brew "go"
brew "grep"
brew "gtk+3"
brew "intltool"
brew "libomp"
brew "libtool"
brew "lua"
brew "nasm"
brew "neovim"
brew "ninja"
brew "node"
brew "opencl-clhpp-headers"
brew "pillow"
brew "pkgconf"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "tcl-tk"
brew "python-tk@3.13"
brew "python@3.9"
brew "python-tk@3.9"
brew "qt"
brew "qt@5"
brew "r"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "scamper"
brew "sevenzip"
brew "sfml@2"
brew "stow"
brew "tailwindcss"
brew "tcpdump"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
cask "arc"
cask "corretto@17"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "kitty"
cask "logitech-g-hub"
cask "maccy"
cask "meshlab"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mysql-shell"
cask "obsidian"
cask "qbittorrent"
cask "rar"
cask "raycast"
cask "spotify"
cask "stats"
cask "wireshark"
vscode "mvllow.rose-pine"
vscode "prisma.prisma"
vscode "vscodevim.vim"
